<?php

// Типа база данных

// ===== Массив с городами ===== \\

$city = array(
    '655017' => 'Абакан',
    '105005' => 'Москва',
    '641780' => 'Новосибирск',
    '454000' => 'Челябинск',
    '641490' => 'Барабинск',
    '641510' => 'Бердск',
    '641600' => 'Искитим',
    '641630' => 'Колывань',
    '641680' => 'Краснообрск',
    '641710' => 'Куйбышев',
    '641760' => 'Мошково',
    '641790' => 'Обь',
    '641800' => 'Ордынское',
    '641970' => 'Черепаново',
);
asort($city);

// Собираем алфавитный массив

foreach ($city as $indexCity => $oneCity) {
    $firstLetterCity = mb_substr($oneCity, 0, 1, "utf8");
    $alphabetCity[$firstLetterCity][$indexCity] = $oneCity;
}

//----------------------------------------------------------------------------------\\

// ===== Массив со станциями метро ===== \\

$stationsMetro = array(
    '2028' => 'Берёзовая роща',
    '2018' => 'Гагаринская',
    '2017' => 'Заельцовская',
    '2029' => 'Золотая Нива',
    '2019' => 'Красный проспект',
    '2027' => 'Маршала Покрышкина',
    '2021' => 'Октябрьская',
    '2020' => 'Площадь Ленина',
    '2024' => 'Площадь Маркса',
    '2022' => 'Речной вокзал',
    '2026' => 'Сибирская',
    '2023' => 'Студенческая',
);
asort($stationsMetro);

// Собираем алфавитный массив

foreach ($stationsMetro as $indexMetro => $oneStation) {
    $firstLetterStation = mb_substr($oneStation, 0, 1, "utf8");
    $alphabetStationMetro[$firstLetterStation][$indexMetro] = $oneStation;
}

//----------------------------------------------------------------------------------\\

// ===== Массив с категориями ===== \\

$category = array(
    'Транспорт'    => array(
        '9'     =>   'Автомобили с пробегом',
        '109'   =>   'Новые автомобили',
        '14'    =>   'Мотоциклы и мототехника',
        '81'    =>   'Грузовики и спецтехника',
        '11'    =>   'Водный транспорт',
        '10'    =>   'Запчасти и аксессуары'
    ),

    'Недвижимость' => array(
        '24'    =>   'Квартиры',
        '23'    =>   'Комнаты',
        '25'    =>   'Дома, дачи, коттеджи',
        '26'    =>   'Земельные участки',
        '85'    =>   'Гаражи и машиноместа',
        '42'    =>   'Коммерческая недвижимость',
        '86'    =>   'Недвижимость за рубежом'
    ),

    'Личные вещи'  => array(
        '27'    =>   'Одежда, обувь, аксессуары',
        '29'    =>   'Детская одежда и обувь',
        '30'    =>   'Товары для детей и игрушки',
        '28'    =>   'Часы и украшения',
        '88'    =>   'Красота и здоровье'
    ),

    'Для дома'     => array(
        '21'    =>   'Бытовая техника',
        '20'    =>   'Мебель и интерьер',
        '87'    =>   'Посуда и товары для кухни',
        '82'    =>   'Продукты питания',
        '19'    =>   'Ремонт и строительство',
        '106'   =>   'Растения',
    ),
);

