<?php

/* {База данных} */

/* {Массив с городами} */

$city = array(
    '655017' => 'Абакан',
    '105005' => 'Москва',
    '641780' => 'Новосибирск',
    '454000' => 'Челябинск',
    '641490' => 'Барабинск',
    '641510' => 'Бердск',
    '641600' => 'Искитим',
    '641630' => 'Колывань',
    '641680' => 'Краснообск',
    '641710' => 'Куйбышев',
    '641760' => 'Мошково',
    '641790' => 'Обь',
    '641800' => 'Ордынское',
    '641970' => 'Черепаново',
);

/* {Сортировка массива} */
asort($city);

/* {Собираем алфавитный массив} */

foreach ($city as $index_city => $one_city) {
    $first_letter_city = mb_substr($one_city, 0, 1, "utf8");
    $alphabet_city[$first_letter_city][$index_city] = $one_city;
}

//----------------------------------------------------------------------------------\\

/* {Массив со станциями метро} */

$stations_metro = array(
    '2028' => 'Берёзовая роща',
    '2018' => 'Гагаринская',
    '2017' => 'Заельцовская',
    '2029' => 'Золотая Нива',
    '2019' => 'Красный проспект',
    '2027' => 'Маршала Покрышкина',
    '2021' => 'Октябрьская',
    '2020' => 'Площадь Ленина',
    '2024' => 'Площадь Маркса',
    '2022' => 'Речной вокзал',
    '2026' => 'Сибирская',
    '2023' => 'Студенческая',
);
/* {Сортировка массива} */
asort($stations_metro);

/* {Собираем алфавитный массив} */

foreach ($stations_metro as $index_metro => $one_station) {
    $first_letter_station = mb_substr($one_station, 0, 1, "utf8");
    $alphabet_station_metro[$first_letter_station][$index_metro] = $one_station;
}

//----------------------------------------------------------------------------------\\

/* {Массив с категориями} */

$category = array(
    'Транспорт'    => array(
        '9'     =>   'Автомобили с пробегом',
        '109'   =>   'Новые автомобили',
        '14'    =>   'Мотоциклы и мототехника',
        '81'    =>   'Грузовики и спецтехника',
        '11'    =>   'Водный транспорт',
        '10'    =>   'Запчасти и аксессуары'
    ),

    'Недвижимость' => array(
        '24'    =>   'Квартиры',
        '23'    =>   'Комнаты',
        '25'    =>   'Дома, дачи, коттеджи',
        '26'    =>   'Земельные участки',
        '85'    =>   'Гаражи и машиноместа',
        '42'    =>   'Коммерческая недвижимость',
        '86'    =>   'Недвижимость за рубежом'
    ),

    'Личные вещи'  => array(
        '27'    =>   'Одежда, обувь, аксессуары',
        '29'    =>   'Детская одежда и обувь',
        '30'    =>   'Товары для детей и игрушки',
        '28'    =>   'Часы и украшения',
        '88'    =>   'Красота и здоровье'
    ),

    'Для дома'     => array(
        '21'    =>   'Бытовая техника',
        '20'    =>   'Мебель и интерьер',
        '87'    =>   'Посуда и товары для кухни',
        '82'    =>   'Продукты питания',
        '19'    =>   'Ремонт и строительство',
        '106'   =>   'Растения',
    ),
);

